ip = "68.203.243.87"
ms = "255.255.224.0"
ms = "11111111.11111111.11100000.00000000"
print(bin(243))       # 11110011
"68.203.___.254   =>   68.203.255.254"
print(68+203+255+254)  # 780

"""
Адрес сети = адрес узла & маска сети
Найдите наибольший в данной сети IP-адрес, 
который может быть назначен компьютеру. 
В ответе укажите сумму числовых значений 
октетов найденного IP-адреса.
"""