from re import *


def f1(s):
    ptn = r'[1-9]+([+*][1-9]+){2}'
    for m in finditer(ptn, s):
        print(m.group())


def f2(s):
    ptn = r'[1-9]+([+*][1-9]+){39}'
    mx = 0
    for m in finditer(ptn, s):
        mx = max(mx, len(m.group()))
    print(mx)


def f3(s):
    ptn = r'[1-9]+([+*][1-9]+){39}'
    ptn = rf'(?=({ptn}))'
    lst = [len(m.group(1)) for m in finditer(ptn, s)]
    print(max(lst))  # 368


def f4(s):
    ptn = r'[1-9]+([+*][1-9]+){39}'
    ptn = rf'(?=({ptn}))'
    for m in finditer(ptn, s):
        if len(m.group(1)) == 368:
            print(m.group(1))


# s = open('./24_24895.txt').readline()
s = "619362256441365374196674257262*8577155876251996166+2*81258655241559242+41582565+435419386*38137+45*13*3*664811+41614465655128*6563884877992115548+6652*52*25*527951759793533+68878*53221+19973727279*2331*583641+1464364+55931+582+66382*4454467453+6638+8691619199419555396614446636464663+1488+5822+1744952*96997797228+8441948+21318782*5*1+83642757*53955744481467999*183917"
# s = "12+34*567+8*9"
# s = "+12++34*567+8*9++86868686"
# s = "2+1*1*2*3*4*5*6*4*3+123456+7+2+3******1212123123131312"

# f1(s)
# f2(s)
# f3(s)
f4(s)

"""
файл состоит из десятичных цифр от 1 до 9, знаков «+» и «*»
Определите максимальное количество символов в непрерывной посл-ти, 
являющейся корректной записью арифметического выражения, 
состоящей из не более чем 40 натуральных чисел и 
знаков арифметических операций между ними.
В ответе укажите количество символов.
"""