s = open('./24_24895.txt').readline()
# s = "12+34*567+8*9"
# s = "+12++34*567+8*9++86868686"
# s = "2+1*1*2*3*4*5*6*4*3+123456+7+2+3******1212123123131312"
# s = "2*3*+13*619362256441365374196674257262*8577155876251996166+2*81258655241559242+41582565+435419386*38137+45*13*3*664811+41614465655128*6563884877992115548+6652*52*25*527951759793533+68878*53221+19973727279*2331*583641+1464364+55931+582+66382*4454467453+6638+8691619199419555396614446636464663+1488+5822+1744952*96997797228+8441948+21318782*5*1+83642757*53955744481467999*183917+9*"

s = s.replace('+', '*')
for i in '12345678': s = s.replace(i, '9')
l = 0
m = 0
d = 0
for r in range(len(s)):
    if d == 0:
        if s[r] == '9':
            l = r
            d = 1
    else:
        if s[r] == '*':
            if s[r-1] == '*':
                d = 0
        else:
            if s[l:r+1].count('*') < 40:
                m = max(m, r-l+1)
            else:
                while s[l] == '9':
                    l += 1
                l += 1
    # print(r, s[r], d, m)
print(m)  # 368 - правильно


"""
12+34*56

++12+++12+3+5+

файл состоит из десятичных цифр от 1 до 9, знаков «+» и «*»
Определите максимальное количество символов в непрерывной посл-ти, 
являющейся корректной записью арифметического выражения, 
состоящей из не более чем 40 натуральных чисел и 
знаков арифметических операций между ними.
В ответе укажите количество символов.
"""