ip = '146.180.173.153'
ms = '255.192.0.0'  # 1111111110000000
nt = ''

print(bin(180))  # 10110100
print(bin(192))  # 11000000
'11111111.11000000.00000000.00000000'
print(int('10111111', 2))
print(146+191+255+254)  # 846

'146.10111111.255.254'
'146.191.255.254'

'''
Определите наибольший IP-адрес данной сети, который может быть присвоен компьютеру. 
В ответе укажите сумму числовых значений октетов найденного IP-адреса.

'''