ip = '68.203.243.87'
ms = '255.255.224.0'
print(bin(224))  # 11100000
print(bin(243))  # 11110011
'68.203.255.254'
print(68+203+255+254)  # 780
# 11111111.11111111.11100000.00000000

# print(2**13-2)

"""
Сеть задана IP-адресом одного из входящих в неё узлов 68.203.243.87 и сетевой маской 255.255.224.0.
Найдите наибольший в данной сети IP-адрес, который может быть назначен компьютеру.
"""